stress-tests/get-subs.yaml
config:
  target: "https://dev-api-ops-subscriptions-thesis.leanderpeter.de"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load


scenarios:
  - name: "Search and buy"
    flow:
      - get:
          url: "/subscriptions"
          headers:
            x-api-key: "{{ $processEnvironment.API_KEY }}"
            x-actor: "leander"